---
kind: method
id: M:Autodesk.Revit.DB.StringParameterValue.#ctor
source: html/a2dc6ddc-baea-bfc4-30c1-1d1cc9139f8e.htm
---
# Autodesk.Revit.DB.StringParameterValue.#ctor Method

Default constructor

## Syntax (C#)
```csharp
public StringParameterValue()
```